<%@page contentType="text/html" pageEncoding="UTF-8"%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"%>
<%@ taglib uri="http://www.springframework.org/tags/form" prefix="springForm"%>
<%@taglib prefix="t" tagdir="/WEB-INF/tags" %>
<%@ taglib prefix="spring" uri="http://www.springframework.org/tags"%>

<t:master>
	<jsp:body>
	<script src="<c:url value="/js/sim.js" />"></script>
		<div class="row">
			<div class="col-md-12 col-sm-12 col-xs-12 x_panel panel-round-bd">
			  	<div class="form-group col-md-4 col-sm-12 col-xs-12">
			    	<label for="mobileNo">กรอกเบอร์โทรศัพท์ 10 หลัก เพื่อทำนายเบอร์</label>
			    	<input type="text" class="form-control" id="mobileNo">
			    	<div class="help-block with-errors"></div>
			  	</div>
			  	
			  	<div class="form-group col-md-2 col-sm-2 col-xs-2">
	 			 	<button class="btn btn-warning button-flex orange-button" id="searchPredict">วิเคราะห์เบอร์โทร</button>
	 			</div>
			</div>
		</div>
	<div class="row">
			<div class="col-md-12 col-sm-12 col-xs-12">
              <div class="x_panel tile overflow_hidden">
              	<div class="row" style="margin:10px">
	                  <b id="logo-phone"><img src="<c:url value="/images/phone.png" />" style="height: 40px;margin-bottom: 10px;"/> เบอร์โทรศัพท์ <img src="<c:url value="/images/truemove.png" />" id="truemove-logo"style="height: 40px;margin-bottom: 10px;"/></b>
                </div>
                <div class="x_content">
                   <div class="panel-round-bd number-panel" style="font-family:tahoma;">
						<div id="show_data"><h2 style="color:red;font-family:rsu_bold;">ระบุเบอร์โทรศัพท์ก่อนเพื่อทำการวิเคราะห์</h2></div>

	<!-- <p><font face="tahoma" color="#0033ff" size="4">   &nbsp;   <b>ผลรวม  <font  size="5">54</font></b>
	 &nbsp; <b>คุณภาพ &nbsp;58%</b></font></p>
	<p><font face="tahoma" color="#0033ff" size="4"> &nbsp; &nbsp; &nbsp;   เกรด   D  :  เบอร์เริ่มเหนื่อย</font></p>
					
<p><font face="tahoma" color="#336600" size="3" ></font><b>		

		<li> เบอร์นี้ มีเลขรวมที่ดี และ

		มีเลขภายในดี แต่มีเลขที่ต้องตัดคะแนนคือ  67 77 21	</li></b>
				
 <font face="tahoma" color="#0033cc" size="3"> 

		<li> เบอร์นี้ มีเลขภาย ส่งเสริมให้ใจกล้า กระฉับกระเฉง ว่องไว  จึงไม่เหมาะกับผู้ที่มีนิสัยใจร้อน</li>
</font>
<font face="tahoma" color="#424200" size="3">
		<li> บทวิเคราะห์ตัวเลขด้านล่าง อยู่ที่คุณเลือก ว่าเบอร์ชุดนี้ เหมาะกับคุณหรือไม่</li> 
				</font></p>
<br>

 
<h2><font size="4" color="red">จุดเด่น ของเบอร์ : <b>086-777-9217</b></font></h2>
<p><font face="tahoma"  color="#623100" size="3"> &nbsp; &nbsp;  


		เหมาะกับคนใจเย็น
 มีความเป็นผู้นำ ไฟแรง สมองเป็นเลิศ งานโครงการใหญ่ มีความคิดสร้างสรรค์ งานออกแบบ ศิลปะได้ทุกแขนง 
</font></p> 
<br>
 
<h2><FONT face="Tahoma"   size="4"  color="red">วิเคราะห์ ผลรวมตัวเลข : <b>54</b></font></h2>  
 

		<p><font face="tahoma" color="#006666" size="3"><b> กำลังพระเคราะห์ได้เลข 54 เป็นเลขที่แสดงถึงนิมิตแห่งความสำเร็จ </b></font></P>
		<p><font face="tahoma" size="3"> &nbsp; &nbsp;  ชีวิตมักจะได้คุ้มครองจากสิ่งศักดิ์สิทธิ์ เป็นคนรู้ง่าย มีสติ ปัญญาแตกฉานเข้าใจอะไรได้งาย อุปสรรคในชีวิตมีน้อยแต่ต้องระวังอุบัติเหตุจากยานพาหนะ และระวังเรื่องเกี่ยวกับสายตา เพราะเลข 54 บวกกันได้ 9 ดาวเกตุธาตุลม</font></p>
 		<P><font face="tahoma" size="3"> &nbsp; &nbsp;  สรุป : เป็นมงคลแก่ชีวิตยิ่งที่ได้ชื่อนี้ เพราะรวมกันได้ 9 พอดี เรื่องงาน ความรัก และอื่นๆ สำเร็จสมปรารถนา จะมีตำแหน่งสูง คนเคารพนับถือ ปัญญาดี เรียนอะไรก็แตกฉาน มีคนคอยค้ำจุนหนุนส่ง ไม่มีทางตกต่ำหรือขาดแคลน สิ่งศักดิ์สิทธิ์คุ้มครอง</font></p>
		<p><font face="tahoma" color="#006666" size="3"><b> หมายเลข 54 ดวงดาวแห่งโชค</b></font>
			<br><font face="tahoma" size="3"> &nbsp; &nbsp;  เป็นเลขดีมาก ถือว่าเป็นหมายเลขดีมากเลขหนึ่ง ชีวิตมักจะมีโชคดีอยู่เนืองๆ มักจะประสบโชคดีอย่างไม่คาดฝันอยู่บ่อยๆ สติปัญญาดี จะได้รับความร่วมมือ จากทุกวงการเป็นอย่างดี จะได้ลาภก้อนโตจากการเสี่ยงทุกรูปแบบ มีความมั่นคงในชีวิต</font></p>
		<p><font face="tahoma" color="#006666" size="3"><b> หมายเลข 54 พลังมหาราชาโชคความสำเร็จ</b></font>
			<br><font face="tahoma" size="3"> &nbsp; &nbsp;  เป็นเลขดีมาก มีมงคลแก่ชีวิต จะประสบความสำเร็จได้โดยง่าย มีตำแหน่งหน้าที่การงานใหญ่โต มีคนเคารพนับถือมากมาย การศึกษาจะประสบความสำเร็จอย่างดีเยี่ยม มีโอกาสได้ทุนหรือทำงานต่างประเทศ มีคนคอยช่วยเหลือ หนุนนำตลอด ชีวิตมักจะได้รับการคุ้มครอง จากสิ่งศักดิ์สิทธิ์ เป็นคนเรียนรู้ง่าย มีความสนุกกับการเรียนรู้ ความรักก็จะราบรื่น มีโอกาสมีรักที่ต่างประเทศได้</font></p>


 <br>


<h2><font size="4" color="red">วิเคราะห์เลขภายใน : <b>086-777-9217</b></font></h2> 
<p>เลขภายในจะบอกถึง ความเป็นตัวตนของผู้ที่ใช้เบอร์มือถือนี้ มีรายละเอียดดังนี้</p> 


<p><font face="tahoma" color="#ccffff" size="2">17</font>
<font face="tahoma" size="3">  &nbsp;  แสวงหาความมั่นคงในชีวิต ชอบอะไรชัวร์ ไฟแรง เก่งกล้า มีความมั่นใจตัวเองสูง มีความเป็นผู้นำ กล้าคิดกล้าทำ พร้อมลงมือทำ เป็นคนที่ทำงานดี  มีสมองเป็นเลิศในด้านธุรกิจและการบริหาร แต่ติดนิสัยทนงตัว โมโหแรงแสดงออกเกินจริง ทำอะไรเอาแต่ใจไม่ฟังใคร เอาตัวเองเป็นศูนย์กลาง เพราะมั่นใจความสามารถของตน บางสถานการณ์ก็บ้าพลัง มักแสดงออกเกินจริง ใจร้อนวู่วาม รักใครรักจริง เกลียดใครก็เกลียดจนตาย เป็นคนที่ทำงานดีมากคนหนึ่ง จริงจัง ถนัดบู๊ ล้างผลาญ เผด็จการกับคนรอบตัวเสมอ เป็นม้ามืดไม่มีคนคิดว่าจะเก่ง มังกรซ่อนลาย จะได้ดีเพราะความเก่ง ควรระวังคนไม่พอใจ หมั่นไส้ วางตัวให้อ่อนลง อาจจะได้ความร่วมมือที่ดียิ่งขึ้น และเจ้าตัวชอบคิดการใหญ่ จึงได้ทำงานโครงการใหญ่ แบบBig Project ซึ่งผลงานก็ออกมาดีทีเดียว ความสัมพันธ์กับสังคมและเพื่อนฝูงดี แต่คนใกล้ตัวกันมักมีปัญหาเพราะจู้จี้และความช้า</font></p> 


<p><font face="tahoma" color="#ccffff" size="2">21</font>
<font face="tahoma" size="3">  &nbsp;  อารมณ์แปรปรวน ขึ้นลงไม่แน่นอน หงุดหงิดง่าย เศร้าหมอง เก็บความรู้สึกไว้ลึกๆ ในที่สุดก็ระเบิด กับคนใกล้ตัว เดี๋ยวแข็งกร้าวเดี๋ยวอ่อนโยน เป็นคนสองบุคลิก มีจินตนาการ แนวคิดที่ไม่เหมือนใคร บทดี ดีใจหาย บทร้าย ก็ดุเหลือเกิน สองอารมณ์ตีกันจึงพาให้สับสน ขัดแย้งในตัวเอง ตัดสินใจอะไรยาก มีการเปลี่ยนใจบ่อยครั้ง มักมีความคิดเห็นแตกต่างจากผู้อื่น ออกความเห็นขวางโลก  ทำให้ทะเลาะกับคนรอบข้างด้วยเรื่องเล็กๆน้อย เพราะเจ้าตัวไม่ยอมรับใครง่ายๆ พูดอะไรก็มักจะขัดขาตัวเองกลับไปกลับมา เช่น อันนี้ก็น่าจะดีนะ แต่คิดอีกทีไม่เอาดีกว่า มักเอาความคิดในกระบวนการตัดสินใจออกมาเป็นคำพูด ต้องระวังอาการของโรคจิตประสาท เกิดจากที่อารมณ์รุนแรงซึ่งยากที่จะยับยั้งของตัวเอง</font></p> 


<p><font face="tahoma" color="#ccffff" size="2">92</font>
<font face="tahoma" size="3">  &nbsp;  รักสวยรักงาม ถนัดศิลปะ มีสุนทรียภาพสูง แต่งตัวเก่ง กระตือรืนร้น มีไหวพริบ เรียนรู้เร็ว มีความคิดสร้างสรรค์ มีจินตนาการสูงส่ง ไอเดียบรรเจิด ไหวพริบดีเรียนรู้เร็ว มีความคิดเพ้อฝันแบบมีโลกส่วนตัว บางครั้งก็ทำตัวลึกลับ มีส่วนขาดส่วนเกินในตัวเอง เหมือนคนโลเล อาจถูกชักจูงได้ง่าย ควรทำตัวให้มีจุดยืนในตัวเอง หากชอบสมาธิภานาจะมีสัมผัสที่หก มีลางสังหรณ์แล้วเกิดขึ้นจริง อาจชอบสะสมของเก่า ของขลัง ของแปลก หรือศึกษาข้อมูลเกี่ยวกับเรื่องเร้นลับ โหราศาสตร์ พิธีกรรม ปรัชญา หรือศาสนา  เหมาะสำหรับทำงานเกี่ยวข้องกับศิลปะได้ทุกแขนง ร้องรำทำเพลง หนัง แสดงละคร ถ่ายภาพ วาดภาพ บันเทิง งานออกแบบ-ตกแต่ง ออกแบบเสื้อผ้า ของกิน กิจการเกี่ยวข้องกับสตรี มีผลดีมากสำหรับธุรกิจนำเข้าส่งออกระหว่างประเทศ</font></p> 


<p><font face="tahoma" color="#ccffff" size="2">79</font>
<font face="tahoma" size="3">  &nbsp;  มองการณ์ไกล วิสัยทัศน์เยี่ยม มีมุมมองแปลกใหม่ น่าสนใจ แต่บางเรื่องคนก็ว่าเพี้ยน ชอบศึกษาเรื่องเทคโนโลยี ติดตามข่าวสารสมัยใหม่ ทันสมัยตลอด พร้อมกับชอบเรื่องราวโบราณ อารยธรรมโบราณ หนังสือโบราณ วิชาโบราณ ลี้ลับ หลุดโลก เหนือธรรมชาติ หาคำอธิบายได้ยาก บางทีชอบครุ่นคิดหมกมุ่นอยู่คนเดียว วางตัวอิสระ ไม่ผูกมัด และในบางราย อาจมีความผูกพันของขลังของเก่า วัตถุโบราณ สามารถทำมาค้าขึ้นกับสิ่งเหล่านี้ หรือชอบสะสมของแปลก เจ้าตัวมีสัมผัสที่หก คาดการณ์แม่น จะได้โชคลาภแบบแปลกๆบ่อยครั้ง เหมาะกับ นักคอมพิวเตอร์ นักธุรกิจไอที นักวางแผน ที่ดิน โรงงานอุตสาหกรรม นักลงทุน  นักค้าวัตถุมงคลวัตถุโบราณ นักธุรกิจแฟรนไชส์ นักธุรกิจเครือข่าย</font></p> 


<p><font face="tahoma" color="#ccffff" size="2">77</font>
<font face="tahoma" size="3">  &nbsp;  เป็นนักสู้ ทรหดอดทน สามารถเก็บรายละเอียดเล็กๆน้อยๆได้ดี รับผิดชอบสูงรอบคอบ เหมาะที่จะทำงานหนัก งานที่ยากลำบาก งานที่สำเร็จช้าๆ งานที่ต้องใช้ความอดทนสูง ชีวิตนี้มีอุปสรรค ปัญหารุมเร้า เครียดสุดๆ ไม่มีเรื่องให้ทุกข์ก็ทุกข์ ทุกข์เพราะความคิด จริงจังกับชีวิต มีแรงกดดันสูง ผ่อนคลายปล่อยไม่เป็น มีเรื่องผิดหวังแล้วจะประชดชีวิต  พูดวาจาขวานผ่าซาก รักการทำงานมากกว่าการอยู่เฉย สู้ทำงานหนัก มักจะได้ทำงานที่ต้องใช้ความอดทนอย่างมาก คิดการใหญ่ มุ่งมั่นสร้างอนาคต เป็นคนคิดมาก คิดกังวลเรื่องวางแผนชีวิตอยู่ตลอด จะทำสิ่งใดมักต้องใช้เวลานาน เพราะเป็นคนย้ำคิดย้ำทำ ขี้จุกจิก ขี้สงสัย อาชีพที่เหมาะคือ ธุรกิจก่อสร้าง ช่างอัญมณี ออกแบบ จิตรกร ที่ดิน ป่าไม้ โรงงานอุตสาหกรรม ค้าของมือสอง งานใหญ่ๆ งานที่ต้องการการสังเกตมีรายละเอียดสูง</font></p> 


<p><font face="tahoma" color="#ccffff" size="2">67</font>
<font face="tahoma" size="3">  &nbsp;  เป็นศัตรูกับการเงินและความรัก เป็นทุกข์เป็นกังวล แม้มุ่งมั่นหาเงินจนมีรายได้ดี แต่ก็มีรายจ่ายสูงเช่นกัน เพราะมีคนช่วยใช้ภาระรับผิดชอบมาก และเจ้าตัวเองก็ใช้เงินเก่งอยู่แล้ว รสนิยมดี จัดว่าเป็นพวกเสพสุขนิยมตัวจริง ภายนอกมีความเป็นอยู่ที่ดูดี แต่เบื้องหลังความหรูหรานั้นมีหนี้สินเยอะแยะ ชักหน้าไม่ถึงหลัง หากปล่อยเครดิตใครไปให้ใครกู้ยืม ทวงยากไม่ได้คืน ความรักรุนแรง คุ้มดี คุ้มร้าย ยากที่จะเดาใจ บทดีก็ดีเหลือเกิน บทร้ายก็ต้องหลีกให้ทัน บางครั้งโรแมนติก มีเสน่ห์เร้าร้อน หากรักใครยอมทุ่มให้หมด แต่รักมักไม่สมหวัง มีอุปสรรค เช่น พลัดพราก แยกจาก หรืออยู่ห่างไกลกัน รักต้องรอ รักที่ต้องอดทน และมีปากเสียงกับคู่ของตนบ่อยครั้ง  อิทธิพลเลขชุดนี้ อาจทำอะไรก็ไม่ได้ดั่งใจ แต่ปัญหาทั้งหมดที่มารุมเร้า ก็ทำให้ผู้ใช้เลขคู่นี้แข็งแกร่งอย่างไร้ข้อสงสัย ระวังปัญหาสุขภาพ มดลูกสำหรับหญิง ต่อมลูกหมากสำหรับชาย สมรรถภาพทางเพศ และระบบกระเพาะปัสสาวะ</font></p> 
 -->
						
					</div>
                </div>
              </div>
            </div>
	    </div>
	    <script>
	    
	    $(document).ready(function(){
    	   $('#mobileNo').mask('000-000-0000');
    	   $('#mobileNo').keyup(function(e){
    		   if(e.keyCode == 13){
    			   $('#searchPredict').click();
    		   }
    	   });
	       $('#searchPredict').click(function(){	
	    	   if($('#mobileNo').val() == ''){
					$('#mobileNo').parent().addClass('has-error has-danger');
					$('#mobileNo').next().html('กรุณาระบุเบอร์โทรศัพท์');
				}else{
					$('#mobileNo').parent().removeClass('has-error has-danger');
					$('#mobileNo').next().html('');
		    	    var simNumber = $('#mobileNo').val().replaceAll('-','');
					sendPostAjax('/Predict/GetDataPredict', { simNumber: simNumber}, function(data){
						if(data.predictContent != null && data.predictContent != ''){
							var header = "<h2 style=\"color:red\">วิเคราะห์เบอร์  : <b>" + $('#mobileNo').val() + "</b></h2><br/>";
							$('#show_data').html(header + data.predictContent);
						}else{
							$('#show_data').html('<h2 style="color:red;font-family:rsu_bold;">ไม่พบข้อมูล</h2>');
						}
						console.log(data);
					});
				}
	       });
	    });
	    	
	    </script>
	</jsp:body>
</t:master>